# BuiltInFailures.MacroFailures Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..MacroFailures Properties
BuiltInFailures..::..MacroFailures Class See Also
---
The BuiltInFailures..::..MacroFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DuplicateModuleName | Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed. |

# See Also
BuiltInFailures..::..MacroFailures Class
Autodesk.Revit.DB Namespace